zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eqei_reg.h
#define EQEI_CNT_CNT_Pos                  (0)                                               /*!< EQEI_T::CNT: CNT Position               */
#define EQEI_CNT_CNT_Msk                  (0xfffffffful << EQEI_CNT_CNT_Pos)                /*!< EQEI_T::CNT: CNT Mask                   */

#define EQEI_CNTHOLD_CNTHOLD_Pos          (0)                                               /*!< EQEI_T::CNTHOLD: CNTHOLD Position       */
#define EQEI_CNTHOLD_CNTHOLD_Msk          (0xfffffffful << EQEI_CNTHOLD_CNTHOLD_Pos)        /*!< EQEI_T::CNTHOLD: CNTHOLD Mask           */

#define EQEI_CNTLATCH_CNTLATCH_Pos        (0)                                               /*!< EQEI_T::CNTLATCH: CNTLATCH Position     */
#define EQEI_CNTLATCH_CNTLATCH_Msk        (0xfffffffful << EQEI_CNTLATCH_CNTLATCH_Pos)      /*!< EQEI_T::CNTLATCH: CNTLATCH Mask         */

#define EQEI_CNTCMP_CNTCMP_Pos            (0)                                               /*!< EQEI_T::CNTCMP: CNTCMP Position         */
#define EQEI_CNTCMP_CNTCMP_Msk            (0xfffffffful << EQEI_CNTCMP_CNTCMP_Pos)          /*!< EQEI_T::CNTCMP: CNTCMP Mask             */

#define EQEI_CNTMAX_CNTMAX_Pos            (0)                                               /*!< EQEI_T::CNTMAX: CNTMAX Position         */
#define EQEI_CNTMAX_CNTMAX_Msk            (0xfffffffful << EQEI_CNTMAX_CNTMAX_Pos)          /*!< EQEI_T::CNTMAX: CNTMAX Mask             */

#define EQEI_CTL_NFCLKSEL_Pos             (0)                                               /*!< EQEI_T::CTL: NFCLKSEL Position          */
#define EQEI_CTL_NFCLKSEL_Msk             (0x7ul << EQEI_CTL_NFCLKSEL_Pos)                  /*!< EQEI_T::CTL: NFCLKSEL Mask              */

#define EQEI_CTL_NFDIS_Pos                (3)                                               /*!< EQEI_T::CTL: NFDIS Position             */
#define EQEI_CTL_NFDIS_Msk                (0x1ul << EQEI_CTL_NFDIS_Pos)                     /*!< EQEI_T::CTL: NFDIS Mask                 */

#define EQEI_CTL_CHAEN_Pos                (4)                                               /*!< EQEI_T::CTL: CHAEN Position             */
#define EQEI_CTL_CHAEN_Msk                (0x1ul << EQEI_CTL_CHAEN_Pos)                     /*!< EQEI_T::CTL: CHAEN Mask                 */

#define EQEI_CTL_CHBEN_Pos                (5)                                               /*!< EQEI_T::CTL: CHBEN Position             */
#define EQEI_CTL_CHBEN_Msk                (0x1ul << EQEI_CTL_CHBEN_Pos)                     /*!< EQEI_T::CTL: CHBEN Mask                 */

#define EQEI_CTL_IDXEN_Pos                (6)                                               /*!< EQEI_T::CTL: IDXEN Position             */
#define EQEI_CTL_IDXEN_Msk                (0x1ul << EQEI_CTL_IDXEN_Pos)                     /*!< EQEI_T::CTL: IDXEN Mask                 */

#define EQEI_CTL_IDXRSTEN_Pos             (7)                                               /*!< EQEI_T::CTL: IDXRSTEN Position          */
#define EQEI_CTL_IDXRSTEN_Msk             (0x1ul << EQEI_CTL_IDXRSTEN_Pos)                  /*!< EQEI_T::CTL: IDXRSTEN Mask              */

#define EQEI_CTL_MODE_Pos                 (8)                                               /*!< EQEI_T::CTL: MODE Position              */
#define EQEI_CTL_MODE_Msk                 (0x7ul << EQEI_CTL_MODE_Pos)                      /*!< EQEI_T::CTL: MODE Mask                  */

#define EQEI_CTL_CHAINV_Pos               (12)                                              /*!< EQEI_T::CTL: CHAINV Position            */
#define EQEI_CTL_CHAINV_Msk               (0x1ul << EQEI_CTL_CHAINV_Pos)                    /*!< EQEI_T::CTL: CHAINV Mask                */

#define EQEI_CTL_CHBINV_Pos               (13)                                              /*!< EQEI_T::CTL: CHBINV Position            */
#define EQEI_CTL_CHBINV_Msk               (0x1ul << EQEI_CTL_CHBINV_Pos)                    /*!< EQEI_T::CTL: CHBINV Mask                */

#define EQEI_CTL_IDXINV_Pos               (14)                                              /*!< EQEI_T::CTL: IDXINV Position            */
#define EQEI_CTL_IDXINV_Msk               (0x1ul << EQEI_CTL_IDXINV_Pos)                    /*!< EQEI_T::CTL: IDXINV Mask                */

#define EQEI_CTL_IDXRSTEV_Pos             (15)                                              /*!< EQEI_T::CTL: IDXRSTEV Position          */
#define EQEI_CTL_IDXRSTEV_Msk             (0x1ul << EQEI_CTL_IDXRSTEV_Pos)                  /*!< EQEI_T::CTL: IDXRSTEV Mask              */

#define EQEI_CTL_OVUNIEN_Pos              (16)                                              /*!< EQEI_T::CTL: OVUNIEN Position           */
#define EQEI_CTL_OVUNIEN_Msk              (0x1ul << EQEI_CTL_OVUNIEN_Pos)                   /*!< EQEI_T::CTL: OVUNIEN Mask               */

#define EQEI_CTL_DIRIEN_Pos               (17)                                              /*!< EQEI_T::CTL: DIRIEN Position            */
#define EQEI_CTL_DIRIEN_Msk               (0x1ul << EQEI_CTL_DIRIEN_Pos)                    /*!< EQEI_T::CTL: DIRIEN Mask                */

#define EQEI_CTL_CMPIEN_Pos               (18)                                              /*!< EQEI_T::CTL: CMPIEN Position            */
#define EQEI_CTL_CMPIEN_Msk               (0x1ul << EQEI_CTL_CMPIEN_Pos)                    /*!< EQEI_T::CTL: CMPIEN Mask                */

#define EQEI_CTL_IDXIEN_Pos               (19)                                              /*!< EQEI_T::CTL: IDXIEN Position            */
#define EQEI_CTL_IDXIEN_Msk               (0x1ul << EQEI_CTL_IDXIEN_Pos)                    /*!< EQEI_T::CTL: IDXIEN Mask                */

#define EQEI_CTL_HOLDTMR0_Pos             (20)                                              /*!< EQEI_T::CTL: HOLDTMR0 Position          */
#define EQEI_CTL_HOLDTMR0_Msk             (0x1ul << EQEI_CTL_HOLDTMR0_Pos)                  /*!< EQEI_T::CTL: HOLDTMR0 Mask              */

#define EQEI_CTL_HOLDTMR1_Pos             (21)                                              /*!< EQEI_T::CTL: HOLDTMR1 Position          */
#define EQEI_CTL_HOLDTMR1_Msk             (0x1ul << EQEI_CTL_HOLDTMR1_Pos)                  /*!< EQEI_T::CTL: HOLDTMR1 Mask              */

#define EQEI_CTL_HOLDTMR2_Pos             (22)                                              /*!< EQEI_T::CTL: HOLDTMR2 Position          */
#define EQEI_CTL_HOLDTMR2_Msk             (0x1ul << EQEI_CTL_HOLDTMR2_Pos)                  /*!< EQEI_T::CTL: HOLDTMR2 Mask              */

