zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eqei_reg.h
#define EQEI_CTL_HOLDTMR3_Pos             (23)                                              /*!< EQEI_T::CTL: HOLDTMR3 Position          */
#define EQEI_CTL_HOLDTMR3_Msk             (0x1ul << EQEI_CTL_HOLDTMR3_Pos)                  /*!< EQEI_T::CTL: HOLDTMR3 Mask              */

#define EQEI_CTL_HOLDCNT_Pos              (24)                                              /*!< EQEI_T::CTL: HOLDCNT Position           */
#define EQEI_CTL_HOLDCNT_Msk              (0x1ul << EQEI_CTL_HOLDCNT_Pos)                   /*!< EQEI_T::CTL: HOLDCNT Mask               */

#define EQEI_CTL_IDXLATEN_Pos             (25)                                              /*!< EQEI_T::CTL: IDXLATEN Position          */
#define EQEI_CTL_IDXLATEN_Msk             (0x1ul << EQEI_CTL_IDXLATEN_Pos)                  /*!< EQEI_T::CTL: IDXLATEN Mask              */

#define EQEI_CTL_IDXRLDEN_Pos             (27)                                              /*!< EQEI_T::CTL: IDXRLDEN Position          */
#define EQEI_CTL_IDXRLDEN_Msk             (0x1ul << EQEI_CTL_IDXRLDEN_Pos)                  /*!< EQEI_T::CTL: IDXRLDEN Mask              */

#define EQEI_CTL_CMPEN_Pos                (28)                                              /*!< EQEI_T::CTL: CMPEN Position             */
#define EQEI_CTL_CMPEN_Msk                (0x1ul << EQEI_CTL_CMPEN_Pos)                     /*!< EQEI_T::CTL: CMPEN Mask                 */

#define EQEI_CTL_EQEIEN_Pos               (29)                                              /*!< EQEI_T::CTL: EQEIEN Position            */
#define EQEI_CTL_EQEIEN_Msk               (0x1ul << EQEI_CTL_EQEIEN_Pos)                    /*!< EQEI_T::CTL: EQEIEN Mask                */

#define EQEI_CTL2_SWAPEN_Pos              (0)                                               /*!< EQEI_T::CTL2: SWAPEN Position           */
#define EQEI_CTL2_SWAPEN_Msk              (0x1ul << EQEI_CTL2_SWAPEN_Pos)                   /*!< EQEI_T::CTL2: SWAPEN Mask               */

#define EQEI_CTL2_CRS_Pos                 (1)                                               /*!< EQEI_T::CTL2: CRS Position              */
#define EQEI_CTL2_CRS_Msk                 (0x3ul << EQEI_CTL2_CRS_Pos)                      /*!< EQEI_T::CTL2: CRS Mask                  */

#define EQEI_CTL2_DIRSRC_Pos              (4)                                               /*!< EQEI_T::CTL2: DIRSRC Position           */
#define EQEI_CTL2_DIRSRC_Msk              (0x3ul << EQEI_CTL2_DIRSRC_Pos)                   /*!< EQEI_T::CTL2: DIRSRC Mask               */

#define EQEI_CTL2_UTEN_Pos                (8)                                               /*!< EQEI_T::CTL2: UTEN Position             */
#define EQEI_CTL2_UTEN_Msk                (0x1ul << EQEI_CTL2_UTEN_Pos)                     /*!< EQEI_T::CTL2: UTEN Mask                 */

#define EQEI_CTL2_UTHOLDEN_Pos            (9)                                               /*!< EQEI_T::CTL2: UTHOLDEN Position         */
#define EQEI_CTL2_UTHOLDEN_Msk            (0x1ul << EQEI_CTL2_UTHOLDEN_Pos)                 /*!< EQEI_T::CTL2: UTHOLDEN Mask             */

#define EQEI_CTL2_UTEVTRST_Pos            (10)                                              /*!< EQEI_T::CTL2: UTEVTRST Position         */
#define EQEI_CTL2_UTEVTRST_Msk            (0x1ul << EQEI_CTL2_UTEVTRST_Pos)                 /*!< EQEI_T::CTL2: UTEVTRST Mask             */

#define EQEI_CTL2_IDXRSTUTS_Pos           (11)                                              /*!< EQEI_T::CTL2: IDXRSTUTS Position        */
#define EQEI_CTL2_IDXRSTUTS_Msk           (0x1ul << EQEI_CTL2_IDXRSTUTS_Pos)                /*!< EQEI_T::CTL2: IDXRSTUTS Mask            */

#define EQEI_CTL2_PHEIEN_Pos              (16)                                              /*!< EQEI_T::CTL2: PHEIEN Position           */
#define EQEI_CTL2_PHEIEN_Msk              (0x1ul << EQEI_CTL2_PHEIEN_Pos)                   /*!< EQEI_T::CTL2: PHEIEN Mask               */

#define EQEI_CTL2_UTIEIEN_Pos             (17)                                              /*!< EQEI_T::CTL2: UTIEIEN Position          */
#define EQEI_CTL2_UTIEIEN_Msk             (0x1ul << EQEI_CTL2_UTIEIEN_Pos)                  /*!< EQEI_T::CTL2: UTIEIEN Mask              */

#define EQEI_UTCNT_UTCNT_Pos              (0)                                               /*!< EQEI_T::UTCNT: UTCNT Position           */
#define EQEI_UTCNT_UTCNT_Msk              (0xfffffffful << EQEI_UTCNT_UTCNT_Pos)            /*!< EQEI_T::UTCNT: UTCNT Mask               */

#define EQEI_UTCMP_UTCMP_Pos              (0)                                               /*!< EQEI_T::UTCMP: UTCMP Position           */
#define EQEI_UTCMP_UTCMP_Msk              (0xfffffffful << EQEI_UTCMP_UTCMP_Pos)            /*!< EQEI_T::UTCMP: UTCMP Mask               */

#define EQEI_STATUS_IDXF_Pos              (0)                                               /*!< EQEI_T::STATUS: IDXF Position           */
#define EQEI_STATUS_IDXF_Msk              (0x1ul << EQEI_STATUS_IDXF_Pos)                   /*!< EQEI_T::STATUS: IDXF Mask               */

#define EQEI_STATUS_CMPF_Pos              (1)                                               /*!< EQEI_T::STATUS: CMPF Position           */
#define EQEI_STATUS_CMPF_Msk              (0x1ul << EQEI_STATUS_CMPF_Pos)                   /*!< EQEI_T::STATUS: CMPF Mask               */

#define EQEI_STATUS_OVUNF_Pos             (2)                                               /*!< EQEI_T::STATUS: OVUNF Position          */
#define EQEI_STATUS_OVUNF_Msk             (0x1ul << EQEI_STATUS_OVUNF_Pos)                  /*!< EQEI_T::STATUS: OVUNF Mask              */

#define EQEI_STATUS_DIRCHGF_Pos           (3)                                               /*!< EQEI_T::STATUS: DIRCHGF Position        */
#define EQEI_STATUS_DIRCHGF_Msk           (0x1ul << EQEI_STATUS_DIRCHGF_Pos)                /*!< EQEI_T::STATUS: DIRCHGF Mask            */

#define EQEI_STATUS_DIRF_Pos              (8)                                               /*!< EQEI_T::STATUS: DIRF Position           */
#define EQEI_STATUS_DIRF_Msk              (0x1ul << EQEI_STATUS_DIRF_Pos)                   /*!< EQEI_T::STATUS: DIRF Mask               */

#define EQEI_STATUS_FIDXEF_Pos            (9)                                               /*!< EQEI_T::STATUS: FIDXEF Position         */
#define EQEI_STATUS_FIDXEF_Msk            (0x1ul << EQEI_STATUS_FIDXEF_Pos)                 /*!< EQEI_T::STATUS: FIDXEF Mask             */

#define EQEI_STATUS_PHEF_Pos              (16)                                              /*!< EQEI_T::STATUS: PHEF Position           */
#define EQEI_STATUS_PHEF_Msk              (0x1ul << EQEI_STATUS_PHEF_Pos)                   /*!< EQEI_T::STATUS: PHEF Mask               */

#define EQEI_STATUS_UTIEF_Pos             (17)                                              /*!< EQEI_T::STATUS: UTIEF Position          */
#define EQEI_STATUS_UTIEF_Msk             (0x1ul << EQEI_STATUS_UTIEF_Pos)                  /*!< EQEI_T::STATUS: UTIEF Mask              */

/** @} EQEI_CONST */
/** @} end of EQEI register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __EQEI_REG_H__ */
